se315/CarInsuranceSystem/code/blog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 17 Nov 2013 19:52:28 UTC +00:00], ["text", "sdv"], ["title", "dv"], ["updated_at", Sun, 17 Nov 2013 19:52:28 UTC +00:00]]
---
	def create
		@post = Post.new(params[:post].permit(:title, :text))

		if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = 16  [["title", "asdfasdggdsdfgsdfg"], ["text", "sagfdasgfddagfssdfgsdfg"], ["updated_at", Mon, 18 Nov 2013 20:27:48 UTC +00:00]]
---
	def update
		@post = Post.find(params[:id])

		if @post.update(params[:post].permit(:title, :text))